src/InformationRegisters/ИсторияПереносовСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ИсторияПереносовСобытий</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кабинет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Событие</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/МеткиКлиентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>МеткиКлиентов</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Активна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Метка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Метки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/СтатусыСобытия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыСобытия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеПодтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Подтверждена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПациентОжидает</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНачат</Name>
					<Comment>Пациент в кресле</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОкончен</Name>
					<Comment>Прием окончен</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемНеСостоялся</Name>
					<Comment>Для предварительной записи более не используется</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПриемОтменен</Name>
					<Comment>Прием отменен</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ВидыВзаимодействия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыВзаимодействия</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Встреча</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокВходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗвонокИсходящий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОнлайнЗаявка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Событие.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Событие</Name>
			<Comment>Предварительная запись клиента</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>АвторДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Врач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНапоминанияДоЗаписи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторДиалога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиЗаписей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КартаКлиента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Карты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодСинхронизации</Name>
					<Comment>Код синхронизации с ID загружаемой базы</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОснованиеРезерва</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеренесённаяПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолисМедСтрахования</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПолисыМедицинскогоСтрахования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтмены</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Резерв</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СсылкаНаПрием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСобытия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусПациента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонныйЗвонок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипСобытия</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФонаРезерва</Name>
					<Comment>Цвет фона резерва</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НормаВремени</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Помещение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Помещения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПризнакЗаблокированно</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаЗаписи</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПричиныЗаписи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Catalogs/ПрограммыСтрахования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Catalog>
		<Properties>
			<Name>ПрограммыСтрахования</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеКратко</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекстаБелый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСтраховыхДоговоров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/РасширениеПланировщикаСервер/Ext/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

#Область ФункцииПодготовкиДанныхДляЗаполненияПланировщика 

//  Функция - Данные заполнения планировщика.
// 
//  Параметры:
//   ДатаВремяНачала	 - 	 - 
//   ДатаВремяКонца	 - 	 - 
//   ТипЗанятий		 - 	 - 
//   Контрагент		 - 	 - 
//   Сотрудники		 - 	 - 
//   Помещения		 - 	 - 
//  
// Возвращаемое значение: массив структур
//   - Описание структуры: ДатаВремяНачала - дата время начала отбора; 
//                         ДатаВремяОкончания - дата время окончания отбора;
//                         Значение - ссылка на объект даных;
//                         Текст - текстовое представление объекта;
//                         Картинка - картинка представления объекта;
// 
Функция ДанныеЗаполненияПланировщикаВизитами(
		ДатаВремяНачала, 
		ДатаВремяОкончания,
		КлиентСегмент          = Неопределено,
		НоменклатураСегмент    = Неопределено,
		СотрудникСегмент       = Неопределено,
		Помещение              = Неопределено,
		СтруктурнаяЕдиница     = Неопределено,
		ОтборПоИзмерению       = Неопределено,
		Статус                 = Неопределено,
		СтатусПодтверждено     = Неопределено,
		Знач Настройки         = Неопределено,
		СтатусОнлайнЗапись     = Неопределено,
		СтатусОконченНеОплачен = Неопределено,
		Визит                  = Неопределено,
		СписокМетокОтбор	   = Неопределено) Экспорт
		
	// Выборка событий.
	ТЗСобытий = Документы.Событие.СобытияЗаУказанныйПериод(
		ДатаВремяНачала, 
		ДатаВремяОкончания,
		Статус,
		СтруктурнаяЕдиница,
		КлиентСегмент,
		СотрудникСегмент,
		Помещение,
		СтатусПодтверждено,,
		СписокМетокОтбор);	
		
	// Для режима отображения "Отмененные", дополняем таблицу событий данными переносов.
	// Вход в процедуру обязателен, добавляются нужные колонки.
	
	РегистрыСведений.ИсторияПереносовСобытий.ДополнитьТаблицуСобытийПереносами( ДатаВремяНачала,
																				ДатаВремяОкончания,
																				СтруктурнаяЕдиница,
																				СотрудникСегмент,
																				Помещение,
																				Статус,
																				КлиентСегмент,
																				ТЗСобытий);
																				
	
		
	ТЗСобытий.Колонки.Добавить("Использован", Новый ОписаниеТипов("Булево"));
	
	МассивСобытий = ТЗСобытий.ВыгрузитьКолонку("Событие");
	Если МассивСобытий.Количество() > 0 Тогда
		ОбщаяТаблицаМеток = РегистрыСведений.МеткиКлиентов.ПолучитьМеткиКлиента(МассивСобытий,, Истина);	
	Иначе
		ОбщаяТаблицаМеток = Новый ТаблицаЗначений();
		ОбщаяТаблицаМеток.Колонки.Добавить("ВладелецМетки");
	КонецЕсли;
		
	// Подготовка массива данных формата предназначенного 
	// для процедуры заполнения планировщика.
	МассивВозврат = Новый Массив;
	                                    
	ЦветФонаПоУмолчанию   = Новый Цвет(164, 209, 251);
	ЦветТекстаПоУмолчанию = Новый Цвет(64, 64, 64);
	ЦветРамкиПоУмолчанию  = Новый Цвет(255, 255, 255);
	
	РазмерШрифта          = ?(Настройки.Свойство("РазмерШрифта"), Настройки.РазмерШрифта, 0);
	
	Для Каждого СтрокаТ ИЗ ТЗСобытий Цикл	
	
		// Проверям по обработанным визитам и пропускаем обработанные.
		Если СтрокаТ.Использован Тогда
			Продолжить;
		КонецЕсли;
		
		ЦветФона   = ЦветФонаПоУмолчанию;
		ЦветТекста = ЦветТекстаПоУмолчанию;
		
		Если СтрокаТ.ЭтоПеренос Тогда
			
			ЦветФона   = Настройки.ЦветПриемПеренесен;
			ЦветТекста = Настройки.ЦветТекстаПеренесен;
		
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.ПриемНачат Тогда
			
			ЦветФона   = Настройки.ЦветПриемНачат;
			ЦветТекста = Настройки.ЦветТекстаПриемНачат;
				
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.ПриемОкончен Тогда
			
			ЦветФона   = Настройки.ЦветПриемОкончен;
			ЦветТекста = Настройки.ЦветТекстаПриемОкончен;
			
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.Подтверждена Тогда
				
			ЦветФона   = Настройки.ЦветПодтверждена;
			ЦветТекста = Настройки.ЦветТекстаПодтверждена;
			
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.НеПодтверждена Тогда
			
			ЦветФона   = Настройки.ЦветНеПодтверждена;
			ЦветТекста = Настройки.ЦветТекстаНеПодтверждена;
			
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.ПриемОтменен Тогда
			
			ЦветФона   =  Настройки.ЦветПриемОтменен;
			ЦветТекста =  Настройки.ЦветТекстаПриемОтменен;
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.ПриемНеСостоялся Тогда
			
			ЦветФона   =  Настройки.ЦветПриемНеСостоялся;
			ЦветТекста =  Настройки.ЦветТекстаПриемНеСостоялся;
			
		ИначеЕсли СтрокаТ.Статус = Перечисления.СтатусыСобытия.ПациентОжидает Тогда
			
			ЦветФона   =  Настройки.ЦветПациентОжидает;
			ЦветТекста =  Настройки.ЦветТекстаПациентОжидает;

		КонецЕсли;
		
		РазрешеноИзменение = СтрокаТ.Статус <> Перечисления.СтатусыСобытия.ПриемНеСостоялся И СтрокаТ.Статус <> Перечисления.СтатусыСобытия.ПриемОкончен;
		
		МассивНоменклатур = Новый Массив;
		МассивСотрудников = Новый Массив;
		МассивПомещений   = Новый Массив;
        МассивКлючейСтрок = Новый Массив;
		
		ПараметрыПоиска = Новый Структура("Событие", СтрокаТ.Событие);
		
		Если ОтборПоИзмерению = "Сотрудник" Тогда		
			
			ПараметрыПоиска.Вставить("Сотрудник"  , СтрокаТ.Сотрудник);
			ПараметрыПоиска.Вставить("Использован", Ложь);			
			
		ИначеЕсли ОтборПоИзмерению = "Ресурс" Тогда						
			
			ПараметрыПоиска.Вставить("Помещение"  , СтрокаТ.Помещение);
			ПараметрыПоиска.Вставить("Использован", Ложь);
			
		КонецЕсли;

		НайденныеСтроки = ТЗСобытий.НайтиСтроки(ПараметрыПоиска);
		
		ОбработкаСтрокВизита(НайденныеСтроки);			

		Для Каждого Строка Из НайденныеСтроки Цикл
			
		   Если МассивНоменклатур.Найти(Строка.НоменклатураНаименование) = Неопределено Тогда  
		       МассивНоменклатур.Добавить(Строка.НоменклатураНаименование);
		   КонецЕсли;
		   Если ОбщегоНазначенияКлиентСерверСтоматология.НайтиВМассивеСтруктур(МассивСотрудников, "Ссылка", Строка.Сотрудник) = Неопределено Тогда  
		       МассивСотрудников.Добавить(Новый Структура("Ссылка, Наименование", Строка.Сотрудник, Строка.СотрудникНаименование));
		   КонецЕсли;
		   Если МассивПомещений.Найти(Строка.ПомещениеНаименование) = Неопределено Тогда  
		       МассивПомещений.Добавить(Строка.ПомещениеНаименование);
		   КонецЕсли;
		   
		   //МассивКлючейСтрок.Добавить(Строка.КлючСтроки);
		   
		КонецЦикла;

		Если ЗначениеЗаполнено(СтрокаТ.Контрагент) Тогда
			
			ДанныеКонтрагента = Новый Структура;
			ДанныеКонтрагента.Вставить("Наименование"	,	СтрокаТ.ФИОПациента);
			ДанныеКонтрагента.Вставить("Фамилия"		,	СтрокаТ.КонтрагентФамилия);
			ДанныеКонтрагента.Вставить("Имя"			,	СтрокаТ.КонтрагентИмя);
			ДанныеКонтрагента.Вставить("Отчество"		,	СтрокаТ.КонтрагентОтчество);
			ДанныеКонтрагента.Вставить("Телефон"		,	?(ЗначениеЗаполнено(СтрокаТ.КонтрагентТелефон), СтрокаТ.КонтрагентТелефон, Неопределено));
			ДанныеКонтрагента.Вставить("ДатаРождения"	,	СтрокаТ.ДатаРожденияКлиента);
			ДанныеКонтрагента.Вставить("НомерМедКарты"	,	СтрокаТ.КонтрагентТекущаяМедицинскаяКартаКодБезНулей);
			
		Иначе
			ДанныеКонтрагента = Новый Структура("Наименование, Фамилия, Имя, Отчество, Телефон, ДатаРождения, НомерМедКарты");	
		КонецЕсли;
		
		МассивМеток = Новый Массив();
		
		Если ЗначениеЗаполнено(СтрокаТ.ПолисМедСтрахования) Тогда
			
			Если ЗначениеЗаполнено(СтрокаТ.ПолисМедСтрахованияДоговор) Тогда
				ДанныеМетки = СтрокаТ.ПМСДоговорКонтрагент;
				МассивМеток.Добавить(Новый Структура("Наименование, ЦветМетки, ЦветТекстаБелый", ДанныеМетки.КраткоеНаименование, ДанныеМетки.ЦветФонаМетки, ДанныеМетки.ЦветТекстаБелый));
			КонецЕсли;
			
			Если ЗначениеЗаполнено(СтрокаТ.ПМСДоговорПрограммаСтрахования) 
				И ЗначениеЗаполнено(СтрокаТ.ПМСКраткоеНаименованиеСтраховойКомпании) Тогда 
				
				ДанныеПрограммыСтрахования = Справочники.ПрограммыСтрахования.ПолучитьТекстЦветФонаИТекста(СтрокаТ.ПМСДоговорПрограммаСтрахования); 
										
				МассивМеток.Добавить(Новый Структура("Наименование, ЦветМетки, ЦветТекстаБелый", ДанныеПрограммыСтрахования.Текст, СтрокаТ.ПМСДоговорПрограммаСтрахования.ЦветФона, ДанныеПрограммыСтрахования.ЦветТекстаБелый));
				
			КонецЕсли;
			
		КонецЕсли;
		
		КоличествоМетокПолиса = МассивМеток.Количество();
		
		Если ОбщаяТаблицаМеток.Количество() > 0 Тогда
			НайденныеМеткиСобытия = ОбщаяТаблицаМеток.НайтиСтроки(Новый Структура("ВладелецМетки", СтрокаТ.Событие));	
			
			Для каждого СтрокаНайденныхМеток Из НайденныеМеткиСобытия Цикл
				МассивМеток.Добавить(СтрокаНайденныхМеток.Метка);
			КонецЦикла;
			
		КонецЕсли;
				
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ДатаНачала"     			, НайденныеСтроки[0].ДатаНачала); 
		СтруктураДанных.Вставить("ДатаОкончания"  			, НайденныеСтроки[НайденныеСтроки.Количество() -1].ДатаОкончания);
		СтруктураДанных.Вставить("Контрагент"           	, СтрокаТ.Контрагент);
		СтруктураДанных.Вставить("Сотрудник"            	, СтрокаТ.Сотрудник);
		СтруктураДанных.Вставить("Помещение"            	, СтрокаТ.Помещение);
		СтруктураДанных.Вставить("ПризнакЗаблокировано" 	, СтрокаТ.ПризнакЗаблокировано);
		СтруктураДанных.Вставить("Статус"		        	, СтрокаТ.Статус);
		СтруктураДанных.Вставить("Резерв"		        	, СтрокаТ.Резерв);
		СтруктураДанных.Вставить("ОснованиеРезерва"			, СтрокаТ.ОснованиеРезерва);
		СтруктураДанных.Вставить("ЦветФона"             	, ЦветФона); 
		СтруктураДанных.Вставить("ЦветТекста"           	, ЦветТекста);
		СтруктураДанных.Вставить("ЦветРамки"            	, ЦветРамкиПоУмолчанию);
		СтруктураДанных.Вставить("ЦветФонаРезерва"			, СтрокаТ.ЦветФонаРезерва);		
		СтруктураДанных.Вставить("РазрешеноИзменение"   	, РазрешеноИзменение);
		СтруктураДанных.Вставить("Событие"              	, СтрокаТ.Событие);
		СтруктураДанных.Вставить("УИДСобытия"				, СтрокаТ.УИДСобытия);
		//СтруктураДанных.Вставить("ТипЗаписи"           , СтрокаТ.ТипЗаписи);
		СтруктураДанных.Вставить("Комментарий"				, СтрокаТ.Комментарий);
		//СтруктураДанных.Вставить("Основание"           , СтрокаТ.Основание);
		//СтруктураДанных.Вставить("Оплачен"             , СтрокаТ.Оплачен);
		//СтруктураДанных.Вставить("ОнлайнЗапись"        , СтрокаТ.ОнлайнЗапись);
		СтруктураДанных.Вставить("МассивНоменклатур"		, МассивНоменклатур);
		СтруктураДанных.Вставить("МассивСотрудников"		, МассивСотрудников);
		СтруктураДанных.Вставить("МассивПомещений"			, МассивПомещений);
		СтруктураДанных.Вставить("МассивКлючейСтрок"		, МассивКлючейСтрок);
		СтруктураДанных.Вставить("ДанныеКонтрагента"		, ДанныеКонтрагента);
		СтруктураДанных.Вставить("ЕстьЗадолженность"		, СтрокаТ.ЕстьЗадолженность);
		СтруктураДанных.Вставить("ЕстьНезавершенныеНарядЗаказы"			, СтрокаТ.ЕстьНезавершенныеНарядЗаказы);
		СтруктураДанных.Вставить("ОбщийСтатусНезавершенныхНарядЗаказов"	, СтрокаТ.ОбщийСтатусНезавершенныхНарядЗаказов);
		СтруктураДанных.Вставить("МеткиСобытия"				, МассивМеток);
        СтруктураДанных.Вставить("КоличествоМетокПолиса"	, КоличествоМетокПолиса);
		СтруктураДанных.Вставить("ПричинаЗаписи"			, СтрокаТ.ПричинаЗаписи);
		СтруктураДанных.Вставить("ПоНаправлению"			, СтрокаТ.ПоНаправлению);
		СтруктураДанных.Вставить("ТелефонныйЗвонок"			, СтрокаТ.ТелефонныйЗвонок);
		СтруктураДанных.Вставить("ИдентификаторДиалога"		, СтрокаТ.ИдентификаторДиалога);
		СтруктураДанных.Вставить("СсылкаНаПрием"			, СтрокаТ.СсылкаНаПрием);
		СтруктураДанных.Вставить("ЭтоПеренос"				, СтрокаТ.ЭтоПеренос);
		
		СтруктураПредставлениеВизита = Документы.Событие.ПредставлениеСобытия(СтруктураДанных, ОтборПоИзмерению = "Ресурс", Настройки);
		
		СтруктураДанных.Вставить("Текст"    , СтруктураПредставлениеВизита.Текст);
        СтруктураДанных.Вставить("Подсказка", СтруктураПредставлениеВизита.Подсказка);
									   
		//// Если строка визита заблокирована для изменений. 			   	
		//Если СтрокаТ.ПризнакЗаблокировано = 1 Тогда 	
		//	СтруктураДанных.Вставить("Картинка", БиблиотекаКартинок.БлокировкаВключена);	
		//КонецЕсли;	
		Если ЗначениеЗаполнено(РазмерШрифта) Тогда
			СтруктураДанных.Вставить("Шрифт", Новый Шрифт(, РазмерШрифта));
		КонецЕсли;	
		//СтруктураДанных.Вставить("Ассистент", СтрокаТ.Ассистент);
		
		МассивВозврат.Добавить(СтруктураДанных);	
		
	КонецЦикла;
	
	//НумерацияЗаписейПланировщика(МассивВозврат);
	
	Возврат МассивВозврат;
	
КонецФункции

// Функция - Данные заполнения планировщика.
// 
// Параметры:
//  ДатаВремяНачала	 - 	 -
//  ДатаВремяКонца	 - 	 -
//  ТипЗанятий		 - 	 -
//  Контрагент		 - 	 -
//  Сотрудники		 - 	 -
//  Помещения		 - 	 -
// 
// Возвращаемое значение: массив структур.
// - Описание структуры: ДатаВремяНачала - дата время начала отбора;
//                       ДатаВремяОкончания - дата время окончания отбора;
//                       Значение - ссылка на объект даных;
//                       Текст - текстовое представление объекта;
//                       Картинка - картинка представления объекта;
// 
Функция ДанныеЗаполненияПланировщикаЗадачами(
	ДатаВремяНачала,
	ДатаВремяКонца,
	Сотрудник = Неопределено) Экспорт
	
	// Выборка занятий.
	МассивЗадач = Задачи.Взаимодействие.ЗадачиЗаУказанныйПериод(
	ДатаВремяНачала,
	ДатаВремяКонца,
	Сотрудник);
	
	// Подготовка массива данных формата предназначенного.
	// для процедуры заполнения планировщика.
	МассивВозврат = Новый Массив;
	
	Для Каждого Задача ИЗ МассивЗадач Цикл
		
		СтруктураДанных = Новый Структура;
		СтруктураДанных.Вставить("ДатаВремяНачала"   , Задача.ВремяНачала);
		СтруктураДанных.Вставить("ДатаВремяОкончания", Задача.ВремяОкончания + 3600);
		СтруктураДанных.Вставить("Сотрудник"         , Задача.Сотрудник);
		СтруктураДанных.Вставить("Задача"            , Задача.Значение);
		СтруктураДанных.Вставить("Текст"   			 , Задача.Текст);
		
		Если Задача.ВидВзаимодействия = Перечисления.ВидыВзаимодействия.Встреча Тогда
			
			СтруктураДанных.Вставить("Картинка", БиблиотекаКартинок.Встреча);
			
		ИначеЕсли Задача.ВидВзаимодействия = Перечисления.ВидыВзаимодействия.ЗвонокВходящий
			ИЛИ Задача.ВидВзаимодействия = Перечисления.ВидыВзаимодействия.ЗвонокИсходящий ТОгда
			
			СтруктураДанных.Вставить("Картинка", БиблиотекаКартинок.ТелефонныйЗвонокВходящий);
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Задача.Цвет) Тогда
			СтруктураДанных.Вставить("ЦветФона", WebЦвета[Задача.Цвет]);
		КонецЕсли;
		
		МассивВозврат.Добавить(СтруктураДанных);
		
	КонецЦикла;
	
	Возврат МассивВозврат;
	
КонецФункции

// Функция - Расчитать интервал времени для режима день по периоду
// 
// Параметры:
//  ДТНачала				 - 	 - 
//  ДТКонца					 - 	 - 
//  ТекДата					 - 	 - 
//  ПереключательПоловиныДня - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РасчитатьИнтервалВремениДляРежимаДеньПоПериоду(Знач ДТНачала, Знач ДТКонца, ТекДата, ПереключательПоловиныДня = Неопределено) Экспорт
	
	ВременныйМассив = Новый Массив;
		
	ВсегоСекундРабвремени = ДТКонца - ДТНачала;
	
	СекундПредРабДня = 0;
	Если НЕ НАчалоДня(ДТНачала) = НачалоДня(ДТКонца) Тогда
		СекундПредРабДня = (Час(ДТКонца) * 60 * 60)  + (Минута(ДТКонца) * 60);
	КонецЕсли;
	
	ДТНачалаПредРабДня = Неопределено;
	ДТКонцаПредРабДня  = Неопределено;
	
	СекундТекРабДня = 0;
	Если ПереключательПоловиныДня = "Утро" Тогда
		
		СекундТекРабДня = (ВсегоСекундРабвремени / 2);
		
		// Если СекундПредРабДня > 0 Тогда
		// 	ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));	
		// КонецЕсли;	
		// 
		// ДТКонца = ДТКонца - СекундТекРабДня;
		// Если Минута(ДТКонца) > 0 Тогда
		// 	ДТКонца = ДТКонца + ((60 - Минута(ДТКонца)) * 60);
		// КонецЕсли;
		// 
		// Если СекундПредРабДня > 0 Тогда
		// 	ДТНачалаПредРабДня = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
		// 	ДТКонцаПредРабДня  = ДТНачалаПредРабДня + СекундПредРабДня - 1;
		// КонецЕсли;
		
		Если СекундПредРабДня > 0 Тогда
			ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));	
			
			ДТКонца = ДТКонца - СекундТекРабДня;
			Если Минута(ДТКонца) > 0 Тогда
				ДТКонца = ДТКонца + ((60 - Минута(ДТКонца)) * 60);
			КонецЕсли;
			
			ДТНачалаПредРабДня = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
			ДТКонцаПредРабДня  = ДТНачалаПредРабДня + СекундПредРабДня - 1;
			
		// Утреннее время - до 12:00	
		ИначеЕсли ДТНачала - НачалоДня(ДТНачала) <= 41400 
			И ДТКонца - НачалоДня(ДТКонца) >= 43200 Тогда 
			
			ДТКонца = НачалоДня(ДТКонца) + 43200;			
			
		КонецЕсли;

	ИначеЕсли ПереключательПоловиныДня = "День" Тогда	
		
		// 	СекундТекРабДня = (ВсегоСекундРабвремени / 2) - СекундПредРабДня;
		// 	
		// 	ДТНачала = ДТНачала + СекундТекРабДня;
		// 	Если Минута(ДТНачала) > 0 Тогда                
		// 		ДТНачала = ДТНачала + ((60 - Минута(ДТНачала)) * 60);
		// 	КонецЕсли;
		// 	
		// 	Если СекундПредРабДня > 0 Тогда
		// 		ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));						
		// 	КонецЕсли;	
		
		Если СекундПредРабДня > 0 Тогда
			
			ДТНачала = ДТНачала + СекундТекРабДня;
			Если Минута(ДТНачала) > 0 Тогда
				ДТНачала = ДТНачала + ((60 - Минута(ДТНачала)) * 60);
			КонецЕсли;	
			ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));						
			
		// Дневное время - с 12:00 до 18:00
		ИначеЕсли ДТНачала - НачалоДня(ДТНачала) <= 43200 	
			И ДТКонца - НачалоДня(ДТКонца) >= 64800 Тогда
			
			ДТНачала = НачалоДня(ДТНачала) + 43200; 	
			ДТКонца  = НачалоДня(ДТНачала) + 64800; 	
			
		ИначеЕсли ДТНачала - НачалоДня(ДТНачала) >= 43200 
			И ДТНачала - НачалоДня(ДТНачала) <= 64800 
			И ДТКонца - НачалоДня(ДТКонца) >= 64800 Тогда
			
			ДТКонца = НачалоДня(ДТНачала) + 64800; 	
			
		ИначеЕсли ДТНачала - НачалоДня(ДТНачала) <= 43200  
			И ДТКонца - НачалоДня(ДТНачала) >= 45000 
			И ДТКонца - НачалоДня(ДТКонца) <= 64800 Тогда
			
			ДТНачала = НачалоДня(ДТНачала) + 43200; 	
			
		КонецЕсли;
				
	ИначеЕсли ПереключательПоловиныДня = "Вечер" Тогда	
		
		// СекундТекРабДня = (ВсегоСекундРабвремени / 2) - СекундПредРабДня;
		// 
		// ДТНачала = ДТНачала + СекундТекРабДня;
		// Если Минута(ДТНачала) > 0 Тогда                
		// 	ДТНачала = ДТНачала + ((60 - Минута(ДТНачала)) * 60);
		// КонецЕсли;
		// 
		// Если СекундПредРабДня > 0 Тогда
		// 	ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));						
		// КонецЕсли;
		
		Если СекундПредРабДня > 0 Тогда
			
			ДТНачала = ДТНачала + СекундТекРабДня;
			Если Минута(ДТНачала) > 0 Тогда
				ДТНачала = ДТНачала + ((60 - Минута(ДТНачала)) * 60);
			КонецЕсли;	
			ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));						
			
		// Вечернее время - после 18:00
		ИначеЕсли ДТНачала - НачалоДня(ДТНачала) <= 64800 	
			И ДТКонца - НачалоДня(ДТКонца) >= 66600 Тогда
			
			ДТНачала = НачалоДня(ДТНачала) + 64800; 	
			
		КонецЕсли;	
		
	Иначе
		Если СекундПредРабДня > 0 Тогда
			
			ДТНачалаПредРабДня = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
			ДТКонцаПредРабДня  = ДТНачалаПредРабДня + СекундПредРабДня - 1;
			
			ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));	
			
		КонецЕсли;		
	КонецЕсли;	
	
	Если ЗначениеЗаполнено(ДТНачалаПредРабДня) 
		И ЗначениеЗаполнено(ДТКонцаПредРабДня)  Тогда 
		
		ВременныйМассив.Добавить(Новый Структура("Начало, Конец", ДТНачалаПредРабДня, ДТКонцаПредРабДня));
		ВременныйМассив.Добавить(Новый Структура("Начало, Конец", ДТНачала, ДТКонца ));
		
	Иначе		
		ВременныйМассив.Добавить(Новый Структура("Начало, Конец", ДТНачала, ДТКонца));				
	КонецЕсли;

	Возврат ВременныйМассив;

КонецФункции
	
// Функция - Расчитать интервал времени для режима день
// 
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  ТекДата					 - 	 - 
//  ПереключательПоловиныДня - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РасчитатьИнтервалВремениДляРежимаДень(СтруктурнаяЕдиница, ТекДата, ПереключательПоловиныДня = Неопределено) Экспорт
	
	// ПериодРаботы = Неопределено
	// 
	// Если СтруктурнаяЕдиница.КруглосуточныйРежим = Ложь Тогда  
	// КонецЕсли;
	
	ПериодРаботы = Справочники.СтруктурныеЕдиницы.ВремяРаботыСтруктурнойЕдиницы(ТекДата, СтруктурнаяЕдиница);	
	
	Если ПериодРаботы <> Неопределено Тогда
		
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, ПериодРаботы.НачалоРаботы);
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, ПериодРаботы.ОкончаниеРаботы);
	Иначе
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));
	КонецЕсли;
	
	Возврат РасчитатьИнтервалВремениДляРежимаДеньПоПериоду(ДТНачала, ДТКонца, ТекДата, ПереключательПоловиныДня); 
		
КонецФункции

// Функция - Расчитать интервал времени для многодневного режима.
//
// Параметры:
//  СтруктурнаяЕдиница		 - 	 -
//  ТекДата					 - 	 -
//  ПереключательИнтервалДня - 	 -
//
// Возвращаемое значение:
//   -
//
Функция РасчитатьИнтервалВремениДляМногодневногоРежима(СтруктурнаяЕдиница, ТекДата, КоличествоДней = 7, ПереключательИнтервалДня = Неопределено) Экспорт
	
	ДТКонцаПредРабДня      = Неопределено;
	МаксПериодРаботы = Справочники.СтруктурныеЕдиницы.МаксимальныйИнтервалРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница);
	
	Если МаксПериодРаботы <> Неопределено Тогда
		
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, МаксПериодРаботы.НачалоРаботы);
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, МаксПериодРаботы.ОкончаниеРаботы);
				
		Если НачалоДня(ДТНачала) <> НачалоДня(ДТКонца) Тогда
			
			Если ДТНачала <> Дата(0001,01,01,00,00,00) Тогда
				ДТКонцаПредРабДня = ДТКонца - 86400;
			КонецЕсли;

			ДТКонца = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));
			
		КонецЕсли;
	
	Иначе
		
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));
		
	КонецЕсли;
		
	//ВременныйМассив = РасчитатьИнтервалВремениДляРежимаДеньПоПериоду(ДТНачала, ДТКонца, ДТКонцаПредРабДня, ТекДата, ПереключательИнтервалДня);
	ВременныйМассив = РасчитатьИнтервалВремениДляРежимаДеньПоПериоду(ДТНачала, ДТКонца, ТекДата, ПереключательИнтервалДня);
	
	МассивИнтервалов = Новый Массив;
	
	// Дублирование интервалов.
	Для ИндексДня = 0 По КоличествоДней - 1 Цикл
				
		Для Каждого Интервал Из ВременныйМассив Цикл
			
			СтруктураИнтервала = Новый Структура;
			СтруктураИнтервала.Вставить("Начало", Интервал.Начало + ИндексДня * 86400);
			СтруктураИнтервала.Вставить("Конец" , Интервал.Конец + ИндексДня * 86400);
			
			МассивИнтервалов.Добавить(СтруктураИнтервала);		
			
		КонецЦикла;	
		
	КонецЦикла;	
	
	Возврат МассивИнтервалов; 
	
КонецФункции

// Функция - Расчитать интервал времени для режима неделя
// 
// Параметры:
//  СтруктурнаяЕдиница		 - 	 - 
//  ТекДата					 - 	 - 
//  ПереключательПоловиныДня - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РасчитатьИнтервалВремениДляРежимаНеделя(СтруктурнаяЕдиница, ТекДата, ПереключательПоловиныДня = Неопределено) Экспорт
	
	// МаксПериодРаботы = Неопределено;
	// 
	// Если СтруктурнаяЕдиница.КруглосуточныйРежим = Ложь Тогда 
	// КонецЕсли;
	
	МаксПериодРаботы = Справочники.СтруктурныеЕдиницы.МаксимальныйИнтервалРаботыСтруктурнойЕдиницы(СтруктурнаяЕдиница);

	Если МаксПериодРаботы <> Неопределено Тогда
		
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, МаксПериодРаботы.НачалоРаботы);
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, МаксПериодРаботы.ОкончаниеРаботы);
	Иначе
		ДТНачала = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,00,00,00));
		ДТКонца  = ОбщегоНазначенияСтоматология.СложитьДатуИВремя(ТекДата, Дата(0001,01,01,23,59,00));
	КонецЕсли;
		
	Возврат РасчитатьИнтервалВремениДляРежимаДеньПоПериоду(ДТНачала, ДТКонца, ТекДата, ПереключательПоловиныДня); 
			
КонецФункции

// Функция - Расчитать интервал времени для режима месяц
// 
// Параметры:
//  ДатаНачала		 - 	 - 
//  ДатаОкончания	 - 	 - 
// 
// Возвращаемое значение:
//   - 
// 
Функция РасчитатьИнтервалВремениДляРежимаМесяц(Знач ДатаНачала, Знач ДатаОкончания) Экспорт
	
	ДТНачала = ДатаНачала;
	ДТКонца  = ДатаОкончания;
	
	Если ДеньНедели(ДТНачала) > 1 Тогда
		ДТНачала = ДТНачала - ((ДеньНедели(ДТНачала) - 1) * 86400); 
	КонецЕсли;	
	
	Дней = Окр((ДТКонца - ДТНачала) / 86400,0, РежимОкругления.Окр15как20);
	Если Дней < 35 Тогда
		ДТКонца  = ДТКонца + (35 - Дней) * 86400;
	ИначеЕсли Дней > 35	И  Дней < 42 Тогда
		ДТКонца  = ДТКонца + (42 - Дней) * 86400;
	КонецЕсли;

	Возврат Новый Структура("Начало, Конец", ДТНачала, ДТКонца);
	
КонецФункции	

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

// Процедура - Обработка визитов
// 
// Параметры:
//  НайденныеСтроки	 - 	 - 
// 
Процедура ОбработкаСтрокВизита(СтрокиВизита)
	
	Индекс = 0;
	Пока Индекс < СтрокиВизита.Количество() - 1 Цикл 
		
		СтрокаВизита = СтрокиВизита[Индекс];
		
		// Изменил, чтобы нормально одновременные визиты отображадись. Брамс.
		// Захотите предъявить, я к вашим услугам.
		//Если СтрокаВизита.ДатаВремяОкончания <> СтрокиВизита[Индекс + 1].ДатаВремяНачала
		Если СтрокаВизита.ДатаОкончания < СтрокиВизита[Индекс + 1].ДатаНачала Тогда
			СтрокиВизита.Удалить(Индекс + 1);
			Продолжить;
		КонецЕсли;
		
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	Для Каждого СтрокаВизита Из СтрокиВизита Цикл						
		СтрокаВизита.Использован = Истина;		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Нумерация записей планировщика
// 
// Параметры:
//  МассивВизитов	 - 	 - 
// 
Процедура НумерацияЗаписейПланировщика(МассивВозврат)
	
	Для Индекс = 0 По МассивВозврат.Количество() - 1 Цикл
		
		КолЭлем = 1; 
		Для ИндексСтр = Индекс + 1 По МассивВозврат.Количество() - 1 Цикл
			
			Если МассивВозврат[ИндексСтр].Визит = МассивВозврат[Индекс].Визит Тогда
				
				КолЭлем = КолЭлем + 1;
				МассивВозврат[ИндексСтр].Текст = "[" + КолЭлем + "] " + МассивВозврат[ИндексСтр].Текст;  
				
			КонецЕсли;
		КонецЦикла;
		
		Если КолЭлем > 1 Тогда
			МассивВозврат[Индекс].Текст = "[1] " + МассивВозврат[Индекс].Текст;
			Индекс = Индекс + КолЭлем - 1;    	
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

// Процедура - Заполнение планировщика.
// 
// Параметры:
//  ОбъектПланировщик		 - 	 -
//  ОтборДатаВремяНачала	 - 	 -
//  ОтборДатаВремяКонца		 - 	 -
//  МассивИзмерений	- массив структур.
//  Описание структуруы: Ключ     - имя измерения;
//                       Элементы - массив элементов измерения;
//  МассивДанных - массив структур.
// 
Процедура ЗаполнениеПланировщика(
	ОбъектПланировщик,
	МассивПериодов,
	МассивИзмерений         = Неопределено,
	МассивДанных,
	МассивИнтерваловФона    = Неопределено,
	ДополнительныеПараметры = Неопределено,
	Визит                   = Неопределено) Экспорт

	// Заполняем тек. период отображения.
	ОбъектПланировщик.ТекущиеПериодыОтображения.Очистить();
	
	Для Каждого ЭлементМ ИЗ МассивПериодов Цикл
		ОбъектПланировщик.ТекущиеПериодыОтображения.Добавить(ЭлементМ.Начало, ЭлементМ.Конец);
	КонецЦикла;
	
	// Заполнение измерений.
	ЗаполнениеПланировщикаФормированиеИзмерений(ОбъектПланировщик, МассивИзмерений);
	
	// Устанвока коллеции фона.
	ОбъектПланировщик.ИнтервалыФона.Очистить();
	
	Если МассивИнтерваловФона <> Неопределено Тогда
		
		Для Каждого ЭлементМ Из МассивИнтерваловФона Цикл
			
			ИнтФона = ОбъектПланировщик.ИнтервалыФона.Добавить(ЭлементМ.ДатаНачала, ЭлементМ.ДатаОкончания);
			
			СоотИзмерения = Новый Соответствие();
			СоотИзмерения.Вставить(ЭлементМ.КлючИзмерения, ЭлементМ.ЗначениеИзмерения);
			
			ФиксСот = Новый ФиксированноеСоответствие(СоотИзмерения);
			
			ИнтФона.ЗначенияИзмерений = ФиксСот;
			ИнтФона.Цвет              = ЭлементМ.ЦветФона;
			
		КонецЦикла;
		
	КонецЕсли;
	
	// Установить цвет линий планировщика.
	ОбъектПланировщик.ЦветЛиний = Новый Цвет(202, 202, 202);
	
	// Заполняем элементы планировщика.
	ЗаполнениеПланировщикаФормированиеЭлементов(ОбъектПланировщик, МассивДанных, МассивИзмерений, Визит);
	
КонецПроцедуры

// Процедура - Заполнение планировщика формирование измерений.
// 
// Параметры:
//  ОбъектПланировщик	 - 	 -
//  МассивИзмерений		 - 	 -
// 
Процедура ЗаполнениеПланировщикаФормированиеИзмерений(ОбъектПланировщик, МассивИзмерений)
		
	ОбъектПланировщик.Измерения.Очистить();
	
	Если Не ЗначениеЗаполнено(МассивИзмерений) Тогда
		Возврат;
	КонецЕсли;
	
	ЭтоМобильныйКлиент = ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент();
	
	ЦветТекстаПоУмолчанию = Новый Цвет(77, 77, 77);
	
	// Массив измерений.
	Для Каждого Измерение Из МассивИзмерений Цикл
		
		Если Не ЗначениеЗаполнено(Измерение.Элементы) Тогда
			Продолжить;
		КонецЕсли;
		
		НовыйУровеньИзм       = ОбъектПланировщик.Измерения.Добавить(Измерение.Ключ);
		НовыйУровеньИзм.Текст = "Измерение";
		
		// Элементы измерения.
		Для Каждого ЭлементИзм Из Измерение.Элементы Цикл
			// Если передана структра данных.
			Если ТипЗнч(ЭлементИзм) = Тип("Структура") Тогда
				
				ЭлИзмерение = НовыйУровеньИзм.Элементы.Добавить(ЭлементИзм.Значение);
				
				Если ЭлементИзм.Свойство("Представление")
					И ЗначениеЗаполнено(ЭлементИзм.Представление) Тогда
					
					Если ТипЗнч(ЭлементИзм.Представление) = Тип("Массив") Тогда
						
						Для Каждого СтрокаМ Из ЭлементИзм.Представление Цикл
							ЭлИзмерение.Текст = ?(СтрокаМ <> ЭлементИзм.Представление[0], ЭлИзмерение.Текст + Символы.ПС, "") + Строка(СтрокаМ);
						КонецЦикла;
					Иначе
						ЭлИзмерение.Текст = Строка(ЭлементИзм.Представление);
					КонецЕсли;
					
				Иначе
					ЭлИзмерение.Текст = Строка(ЭлементИзм.Значение);
				КонецЕсли;
				
				Если ЭлементИзм.Свойство("ЦветФона")
					И ЭлементИзм.ЦветФона <> Неопределено Тогда
					
					ЭлИзмерение.ЦветФона   = ЭлементИзм.ЦветФона;
					ЭлИзмерение.ЦветТекста = ОбщегоНазначенияВызовСервера.ПолучитьЦветТекстаПоЦветуФона(ЭлементИзм.ЦветФона);
				Иначе
					ЭлИзмерение.ЦветТекста = ЦветТекстаПоУмолчанию;
				КонецЕсли;
				
				ЭлИзмерение.Шрифт = ?(ЭтоМобильныйКлиент = Истина, Новый Шрифт(ЭлИзмерение.Шрифт,, 4), Новый Шрифт(ЭлИзмерение.Шрифт,, 9));
			Иначе
				ЭлИзмерение       = НовыйУровеньИзм.Элементы.Добавить(ЭлементИзм);
				ЭлИзмерение.Текст = Строка(ЭлементИзм);
			КонецЕсли;
			
			ЭлИзмерение.ЦветРамки = Новый Цвет(144, 144, 144);
			
		КонецЦикла;
		
	КонецЦикла;

КонецПроцедуры

// Процедура - Заполнение планировщика формирование элементов.
// 
// Параметры:
//  МассивДанных		 - 	 -
//  МассивИзмерений		 - 	 -
//  ОбъектПланировщик	 - 	 -
// 
Процедура ЗаполнениеПланировщикаФормированиеЭлементов(ОбъектПланировщик, МассивДанных, МассивИзмерений, Визит)
	
	Если Не ЗначениеЗаполнено(Визит) Тогда
		
		ОбъектПланировщик.Элементы.Очистить();
		
	Иначе
		
		МассивУдаляемыхЭлементовПланировщика = Новый Массив;
		Для Каждого ЭлементПланировщика Из ОбъектПланировщик.Элементы Цикл	
			Если ТипЗнч(ЭлементПланировщика.Значение) = Тип("Структура") 
					И ЭлементПланировщика.Значение.Свойство("Визит") И ЭлементПланировщика.Значение.Визит = Визит Тогда
				МассивУдаляемыхЭлементовПланировщика.Добавить(ЭлементПланировщика);
			КонецЕсли;		
		КонецЦикла;
		
		Для Каждого ЭлементПланировщика Из МассивУдаляемыхЭлементовПланировщика Цикл
			ОбъектПланировщик.Элементы.Удалить(ЭлементПланировщика);
		КонецЦикла;
		
	КонецЕсли;

	Для Каждого ЭлементДанных ИЗ МассивДанных Цикл
		
		НовыйЭлемент            = ОбъектПланировщик.Элементы.Добавить(
			ЭлементДанных.ДатаНачала,
			ЭлементДанных.ДатаОкончания);
		НовыйЭлемент.Значение   = ЭлементДанных;			
		НовыйЭлемент.Текст      = ПолучитьЗначениеПараметра(ЭлементДанных, "Текст"     , НовыйЭлемент.Текст);
		НовыйЭлемент.Подсказка  = ПолучитьЗначениеПараметра(ЭлементДанных, "Подсказка" , НовыйЭлемент.Подсказка);
		НовыйЭлемент.Картинка   = ПолучитьЗначениеПараметра(ЭлементДанных, "Картинка"  , НовыйЭлемент.Картинка);
		НовыйЭлемент.ЦветФона   = ПолучитьЗначениеПараметра(ЭлементДанных, "ЦветФона"  , НовыйЭлемент.ЦветФона);
		НовыйЭлемент.ЦветРамки  = ПолучитьЗначениеПараметра(ЭлементДанных, "ЦветРамки" , НовыйЭлемент.ЦветРамки);
		НовыйЭлемент.ЦветТекста = ПолучитьЗначениеПараметра(ЭлементДанных, "ЦветТекста", НовыйЭлемент.ЦветТекста);
		
		// Если это мобильный клиент.
		Если ОбщегоНазначенияКлиентСервер.ЭтоМобильныйКлиент() = Истина Тогда
		    НовыйЭлемент.Шрифт = Новый Шрифт(НовыйЭлемент.Шрифт,, 3);
		Иначе
			НовыйЭлемент.Шрифт = ПолучитьЗначениеПараметра(ЭлементДанных, "Шрифт", НовыйЭлемент.Шрифт);
			
			//НовыйЭлемент.Шрифт = ПолучитьЗначениеПараметра(ЭлементДанных, "Шрифт", Новый Шрифт(, 12));

		КонецЕсли;

		// Привязка элемента в нужных измерениях.
		// Внимание!!!.
		// Элемент привязки измрения извлекается из самого значения.
		// т.е. свойство с заданным ключем должно быть в объекте!.
		Если МассивИзмерений <> Неопределено И МассивИзмерений.Количество() > 0 Тогда
			
			СоответствиеЗначений = Новый Соответствие;
			Для Каждого Измерение ИЗ МассивИзмерений Цикл
				СоответствиеЗначений.Вставить(Измерение.Ключ, ЭлементДанных[Измерение.Ключ]);
			КонецЦикла;
			
			НовыйЭлемент.ЗначенияИзмерений = Новый ФиксированноеСоответствие(СоответствиеЗначений);
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры

// Функция - Получить значение параметра данных.
// 
// Параметры:
//  ЗначениеПоУмолчанию	 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПолучитьЗначениеПараметра(ПараметрыДанных, ИскомыйПараметр, ЗначениеПоУмолчанию) Экспорт
		
	Если ПараметрыДанных.Свойство(ИскомыйПараметр)
		И ПараметрыДанных[ИскомыйПараметр] <> Неопределено Тогда
		
		Возврат ПараметрыДанных[ИскомыйПараметр];
	КонецЕсли;
	
	Возврат ЗначениеПоУмолчанию;

КонецФункции

// Функция - Привести строку к нужной длине.
// 
// Параметры:
//  пСтрока	 - 	 -
//  Длина	 - 	 -
// 
// Возвращаемое значение:
//   -
// 
Функция ПривестиСтрокуКНужнойДлине(Знач СтрокаДанных, Знач Длина) Экспорт
	
	СтрВр  = СокрЛП(СтрокаДанных);
	СтрВр  = СтрЗаменить(СтрВр, " ", Символы.НПП);
	Справа = Ложь;
	
	РазницаДлины = (Длина - СтрДлина(СтрВр));

	Если РазницаДлины > 0 Тогда
		
		ПроцентОтклонения = ((РазницаДлины * 100) / Длина);
		
		Если ПроцентОтклонения > 30 И ПроцентОтклонения < 50 Тогда
			Длина = Длина + (Длина / 4);
		ИначеЕсли ПроцентОтклонения >= 50 Тогда
			Длина = Длина + (Длина / 3);
		КонецЕсли;
		
	ИначеЕсли СтрДлина(СтрВр) > Длина Тогда
		
		СтрВр = Лев(СтрВр, Длина - 3) + "...";
		
	КонецЕсли;
	
	Пока СтрДлина(СтрВр) < Длина Цикл
		
		Если Справа = Истина Тогда
			СтрВр = СтрВр + Символы.НПП;
		Иначе
			СтрВр = Символы.НПП + СтрВр;
		КонецЕсли;
		
		Справа = Не Справа;
		
	КонецЦикла;
	
	Возврат СтрВр;
	
КонецФункции

#КонецОбласти
